DataProcessors/РассылкаПрайсЛиста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>РассылкаПрайсЛиста</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаДату</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиКонтрагентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КонтрагентСсылка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрагентНаименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЦеныПрайса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыкладыватьПрайсНаФТП</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФТПАдресДляПрайса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФТПКаталогДляПрайса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФТППортДляПрайса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФТПЛогинДляПрайса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФТППарольДляПрайса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФорматФайлаПрайса</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыФайловРассылок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АрхивироватьПрайс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальныйОстатокДляПрайса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РассылатьПрайс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭлектроннойПочтыКонтрагентаДляРассылкиПрайса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СоздатьПрайсИОтослать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноеКоличествоПрайсовВДень</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтправленныеПрайсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВремяОтправки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипРассылки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыРассылокЭлектроннойПочты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыОрганизаций</Name>
			<Comment>(Общ)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комиссионер</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыВРезервеНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРезервеНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.МаркировкаТоваровГИСМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыВЯчейках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВЯчейках</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПроблемнаяЯчейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаЦены</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/РассылкаПрайсЛиста/Ext/ObjectModule.bsl
Перем мЭтоКазань; 

Процедура СформироватьИОтправитьПрайсыМодуль(ТекстЛога, Комментарий = "") Экспорт;
	
	// проверяем, все ли строки сохранены
	ОтборИзмененныхСтрок = Новый Структура("Изменен", Истина);
	НайденныеСтроки = НастройкиКонтрагентов.НайтиСтроки(ОтборИзмененныхСтрок);
	
	Если НайденныеСтроки.Количество()> 0 Тогда
		
		ТекстСообщения = "Имеются несохраненные настройки контрагентов. Необходимо сохранить настройки!";
		#Если Клиент Тогда
			Сообщить(ТекстСообщения,СтатусСообщения.Важное);
		#Иначе
			ЗаписьЖурналаРегистрации("ОбработкаРассылкаПрайсЛистов",УровеньЖурналаРегистрации.Информация,,,ТекстСообщения);
		#КонецЕсли 
		
		Возврат;
		
	КонецЕсли;	
	
	УчетнаяЗаписьЭлектроннойПочты = Константы.ОсновнаяУчетнаяЗаписьЭлектроннойПочты.Получить();
	
	Если НЕ ЗначениеЗаполнено(УчетнаяЗаписьЭлектроннойПочты) Тогда 
		
		ТекстСообщения = "Не заполнена константа основной записи электронной почты!";
		
		#Если Клиент Тогда
			Сообщить(ТекстСообщения,СтатусСообщения.Важное);
		#Иначе
			ЗаписьЖурналаРегистрации("ОбработкаРассылкаПрайсЛистов",УровеньЖурналаРегистрации.Информация,,,ТекстСообщения);
		#КонецЕсли 
		
		Возврат;
		
	КонецЕсли;	
	
	// переменные
	ТекстЛога = "Начало - >> " + ТекущаяДата();
	Разделитель = ";";
	ДатаОтчет = ТекущаяДата(); 
	
	ОтборОтсылаемыхСтрок = Новый Структура("СоздатьПрайсИОтослать", Истина);
	НайденныеСтроки = ЭтотОбъект.НастройкиКонтрагентов.НайтиСтроки(ОтборОтсылаемыхСтрок);
	
	ТабКонтрагентов = НастройкиКонтрагентов.Выгрузить(НайденныеСтроки,
	"КонтрагентСсылка, ТипЦеныПрайса, ВыкладыватьПрайсНаФТП,ФТПАдресДляПрайса,ФТПКаталогДляПрайса,ФТПЛогинДляПрайса,ФТППортДляПрайса,ФТППарольДляПрайса, ФорматФайлаПрайса, АрхивироватьПрайс, МаксимальныйОстатокДляПрайса, АдресЭлектроннойПочтыКонтрагентаДляРассылкиПрайса, МаксимальноеКоличествоПрайсовВДень");
	
	Если ТабКонтрагентов.Количество() = 0 Тогда 
		
		ТекстЛога = ТекстЛога + Символы.ПС + "Нет клиентов для формирования прайс-листов" + Символы.ПС + "Окончание : " + ТекущаяДата();
		Возврат;
		
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	ОрганизацияМК = Справочники.Организации.ПустаяСсылка();	
	ОрганизацияМСК = Справочники.Организации.ПустаяСсылка();
	
	Если мЭтоКазань Тогда
		
		ОрганизацияМК 	= Константы.ОсновнаяОрганизация.Получить();	
		ОрганизацияМСК 	= Константы.ОсновнаяОрганизацияДляОплатыНаличнымиДляВодителей.Получить();
		
		Запрос.УстановитьПараметр("ОрганизацияМК", ОрганизацияМК);
		Запрос.УстановитьПараметр("ОрганизацияМСК", ОрганизацияМСК);
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТабЗагрузки.КонтрагентСсылка,
		|	ТабЗагрузки.ТипЦеныПрайса КАК ТипЦеныПрайса,
		|	ТабЗагрузки.ВыкладыватьПрайсНаФТП,
		|	ТабЗагрузки.ФТПАдресДляПрайса,
		|	ТабЗагрузки.ФТПКаталогДляПрайса,
		|	ТабЗагрузки.ФТПЛогинДляПрайса,
		|	ТабЗагрузки.ФТППортДляПрайса,
		|	ТабЗагрузки.ФТППарольДляПрайса,
		|	ТабЗагрузки.ФорматФайлаПрайса,
		|	ТабЗагрузки.АрхивироватьПрайс,
		|	ТабЗагрузки.МаксимальныйОстатокДляПрайса,
		|	ТабЗагрузки.АдресЭлектроннойПочтыКонтрагентаДляРассылкиПрайса,
		|	ВЫБОР
		|		КОГДА ТабЗагрузки.МаксимальноеКоличествоПрайсовВДень = 0
		|			ТОГДА 1
		|		ИНАЧЕ ТабЗагрузки.МаксимальноеКоличествоПрайсовВДень
		|	КОНЕЦ КАК МаксимальноеКоличествоПрайсовВДень
		|ПОМЕСТИТЬ Таб
		|ИЗ
		|	&ТабЗагрузки КАК ТабЗагрузки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ТипЦеныПрайса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТипыЦенНоменклатуры.Ссылка КАК ТипЦеныПрайса
		|ПОМЕСТИТЬ ТипыВидовЦен
		|ИЗ
		|	Таб КАК Таб
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТипыЦенНоменклатуры КАК ТипыЦенНоменклатуры
		|		ПО Таб.ТипЦеныПрайса = ТипыЦенНоменклатуры.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) КАК Остаток,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) < 0
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0)
		|	КОНЕЦ КАК ОстатокДляДоговоровМК,
		|	ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) КАК ВРезерве
		|ПОМЕСТИТЬ ПромОстаткиТоваров
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладахОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Остатки(
		|				,
		|				Склад = &Склад
		|					И Организация = &ОрганизацияМК) КАК ТоварыОрганизацииМКОстатки
		|		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыОрганизацииМКОстатки.Номенклатура
		|			И ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры = ТоварыОрганизацииМКОстатки.ХарактеристикаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыВРезервеНаСкладахОстатки
		|		ПО ТоварыНаСкладахОстатки.Склад = ТоварыВРезервеНаСкладахОстатки.Склад
		|			И ТоварыНаСкладахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
		|ГДЕ
		|	ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) > 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиТоваров.Номенклатура КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0) - ОстаткиТоваров.ВРезерве < ЕСТЬNULL(ОстаткиТоваров.Остаток, 0)
		|			ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0) - ОстаткиТоваров.ВРезерве
		|		ИНАЧЕ ЕСТЬNULL(ОстаткиТоваров.Остаток, 0)
		|	КОНЕЦ КАК Остаток,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0) - ОстаткиТоваров.ВРезерве < ЕСТЬNULL(ОстаткиТоваров.ОстатокДляДоговоровМК, 0)
		|			ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0) - ОстаткиТоваров.ВРезерве
		|		ИНАЧЕ ЕСТЬNULL(ОстаткиТоваров.ОстатокДляДоговоровМК, 0)
		|	КОНЕЦ КАК ОстатокДляДоговоровМК
		|ПОМЕСТИТЬ ОстаткиТоваров
		|ИЗ
		|	ПромОстаткиТоваров КАК ОстаткиТоваров
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
		|				,
		|				Склад = &Склад
		|					И НЕ Ячейка.НеУчитыватьВОперативномУчете) КАК ТоварыВЯчейкахОстатки
		|		ПО ОстаткиТоваров.Номенклатура = ТоварыВЯчейкахОстатки.Номенклатура
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0) - ОстаткиТоваров.ВРезерве < ЕСТЬNULL(ОстаткиТоваров.Остаток, 0)
		|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0) - ОстаткиТоваров.ВРезерве
		|			ИНАЧЕ ЕСТЬNULL(ОстаткиТоваров.Остаток, 0)
		|		КОНЕЦ > 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Период,
		|	ЦеныНоменклатурыСрезПоследних.Регистратор,
		|	ЦеныНоменклатурыСрезПоследних.НомерСтроки,
		|	ЦеныНоменклатурыСрезПоследних.Активность,
		|	ЦеныНоменклатурыСрезПоследних.ТипЦен,
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры,
		|	ЦеныНоменклатурыСрезПоследних.Валюта,
		|	ЦеныНоменклатурыСрезПоследних.Цена,
		|	ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения,
		|	ЦеныНоменклатурыСрезПоследних.ПроцентСкидкиНаценки,
		|	ЦеныНоменклатурыСрезПоследних.СпособРасчетаЦены
		|ПОМЕСТИТЬ ЦеныНоменклатурыСрезПоследних
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			,
		|			ТипЦен В
		|				(ВЫБРАТЬ
		|					ТипыВидовЦен.ТипЦеныПрайса
		|				ИЗ
		|					ТипыВидовЦен КАК ТипыВидовЦен
		|				ГДЕ
		|					НЕ ТипыВидовЦен.ТипЦеныПрайса.Рассчитывается)) КАК ЦеныНоменклатурыСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Период,
		|	ЦеныНоменклатурыСрезПоследних.Регистратор,
		|	ЦеныНоменклатурыСрезПоследних.НомерСтроки,
		|	ЦеныНоменклатурыСрезПоследних.Активность,
		|	ТипыВидовЦен.ТипЦеныПрайса,
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры,
		|	ЦеныНоменклатурыСрезПоследних.Валюта,
		|	ЦеныНоменклатурыСрезПоследних.Цена * (1 + ТипыВидовЦен.ТипЦеныПрайса.ПроцентСкидкиНаценки / 100),
		|	ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения,
		|	ТипыВидовЦен.ТипЦеныПрайса.ПроцентСкидкиНаценки,
		|	ЦеныНоменклатурыСрезПоследних.СпособРасчетаЦены
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ) КАК ЦеныНоменклатурыСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТипыВидовЦен КАК ТипыВидовЦен
		|		ПО ЦеныНоменклатурыСрезПоследних.ТипЦен = ТипыВидовЦен.ТипЦеныПрайса.БазовыйТипЦен
		|ГДЕ
		|	ТипыВидовЦен.ТипЦеныПрайса.Рассчитывается
		|	И ТипыВидовЦен.ТипЦеныПрайса.СпособРасчетаЦены = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаЦены.ПоПроцентнойНаценкеНаБазовыйТип)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СправочникНоменклатура.Родитель КАК НоменклатураРодитель,
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	ОстаткиТоваров.Остаток КАК Количество,
		|	ОстаткиТоваров.ОстатокДляДоговоровМК КАК КоличествоДляДоговоровСМК,
		|	ВЫБОР
		|		КОГДА ЦеныНоменклатурыСрезПоследних.Валюта = &ВалютаРубли
		|			ТОГДА ЦеныНоменклатурыСрезПоследних.Цена
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
		|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
		|					ТОГДА ЦеныНоменклатурыСрезПоследних.Цена * (КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность)
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ КАК Цена,
		|	ЦеныНоменклатурыСрезПоследних.ТипЦен КАК ТипЦен,
		|	СправочникНоменклатура.КодПроизводителя КАК КодПроизводителя,
		|	СправочникНоменклатура.ЕдиницаХраненияОстатков,
		|	ВЫБОР
		|		КОГДА СправочникНоменклатура.Кратность = 0
		|			ТОГДА 1
		|		ИНАЧЕ СправочникНоменклатура.Кратность
		|	КОНЕЦ КАК Кратность
		|ПОМЕСТИТЬ ТабЦен
		|ИЗ
		|	ЦеныНоменклатурыСрезПоследних КАК ЦеныНоменклатурыСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
		|		ПО ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОстаткиТоваров КАК ОстаткиТоваров
		|		ПО (ОстаткиТоваров.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		|		ПО ЦеныНоменклатурыСрезПоследних.Номенклатура = СправочникНоменклатура.Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ТипЦен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РассылкаДокументов.Контрагент,
		|	КОЛИЧЕСТВО(РассылкаДокументов.Контрагент) КАК КоличествоОтправленных
		|ПОМЕСТИТЬ ТабРассылкаДокументовПоПочте
		|ИЗ
		|	РегистрСведений.РассылкаДокументов КАК РассылкаДокументов
		|ГДЕ
		|	РассылкаДокументов.Период МЕЖДУ &ПериодНачало И &ПериодОкончание
		|	И РассылкаДокументов.ТипРассылки = ЗНАЧЕНИЕ(Перечисление.ТипыРассылокЭлектроннойПочты.ПрайсЛист)
		|
		|СГРУППИРОВАТЬ ПО
		|	РассылкаДокументов.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РассылкаДокументов2.Контрагент,
		|	КОЛИЧЕСТВО(РассылкаДокументов2.Контрагент) КАК КоличествоОтправленных
		|ПОМЕСТИТЬ ТабРассылкаДокументовПоФТП
		|ИЗ
		|	РегистрСведений.РассылкаДокументов КАК РассылкаДокументов2
		|ГДЕ
		|	РассылкаДокументов2.Период МЕЖДУ &ПериодНачало И &ПериодОкончание
		|	И РассылкаДокументов2.ТипРассылки = ЗНАЧЕНИЕ(Перечисление.ТипыРассылокЭлектроннойПочты.ПрайсЛистНаФТП)
		|
		|СГРУППИРОВАТЬ ПО
		|	РассылкаДокументов2.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТипыВидовЦен.ТипЦеныПрайса
		|ИЗ
		|	ТипыВидовЦен КАК ТипыВидовЦен";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТабЗагрузки.КонтрагентСсылка,
		|	ТабЗагрузки.ТипЦеныПрайса КАК ТипЦеныПрайса,
		|	ТабЗагрузки.ВыкладыватьПрайсНаФТП,
		|	ТабЗагрузки.ФТПАдресДляПрайса,
		|	ТабЗагрузки.ФТПКаталогДляПрайса,
		|	ТабЗагрузки.ФТПЛогинДляПрайса,
		|	ТабЗагрузки.ФТППортДляПрайса,
		|	ТабЗагрузки.ФТППарольДляПрайса,
		|	ТабЗагрузки.ФорматФайлаПрайса,
		|	ТабЗагрузки.АрхивироватьПрайс,
		|	ТабЗагрузки.МаксимальныйОстатокДляПрайса,
		|	ТабЗагрузки.АдресЭлектроннойПочтыКонтрагентаДляРассылкиПрайса,
		|	ВЫБОР
		|		КОГДА ТабЗагрузки.МаксимальноеКоличествоПрайсовВДень = 0
		|			ТОГДА 1
		|		ИНАЧЕ ТабЗагрузки.МаксимальноеКоличествоПрайсовВДень
		|	КОНЕЦ КАК МаксимальноеКоличествоПрайсовВДень
		|ПОМЕСТИТЬ Таб
		|ИЗ
		|	&ТабЗагрузки КАК ТабЗагрузки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ТипЦеныПрайса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТипыЦенНоменклатуры.Ссылка КАК ТипЦеныПрайса
		|ПОМЕСТИТЬ ТипыВидовЦен
		|ИЗ
		|	Таб КАК Таб
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТипыЦенНоменклатуры КАК ТипыЦенНоменклатуры
		|		ПО Таб.ТипЦеныПрайса = ТипыЦенНоменклатуры.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) КАК Остаток,
		|	ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) КАК ВРезерве
		|ПОМЕСТИТЬ ПромОстаткиТоваров
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладахОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыВРезервеНаСкладахОстатки
		|		ПО ТоварыНаСкладахОстатки.Склад = ТоварыВРезервеНаСкладахОстатки.Склад
		|			И ТоварыНаСкладахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
		|ГДЕ
		|	ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) > 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиТоваров.Номенклатура КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0) - ОстаткиТоваров.ВРезерве < ЕСТЬNULL(ОстаткиТоваров.Остаток, 0)
		|			ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0) - ОстаткиТоваров.ВРезерве
		|		ИНАЧЕ ЕСТЬNULL(ОстаткиТоваров.Остаток, 0)
		|	КОНЕЦ КАК Остаток
		|ПОМЕСТИТЬ ОстаткиТоваров
		|ИЗ
		|	ПромОстаткиТоваров КАК ОстаткиТоваров
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
		|				,
		|				Склад = &Склад
		|					И НЕ Ячейка.НеУчитыватьВОперативномУчете) КАК ТоварыВЯчейкахОстатки
		|		ПО ОстаткиТоваров.Номенклатура = ТоварыВЯчейкахОстатки.Номенклатура
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0) - ОстаткиТоваров.ВРезерве < ЕСТЬNULL(ОстаткиТоваров.Остаток, 0)
		|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0) - ОстаткиТоваров.ВРезерве
		|			ИНАЧЕ ЕСТЬNULL(ОстаткиТоваров.Остаток, 0)
		|		КОНЕЦ > 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Период,
		|	ЦеныНоменклатурыСрезПоследних.Регистратор,
		|	ЦеныНоменклатурыСрезПоследних.НомерСтроки,
		|	ЦеныНоменклатурыСрезПоследних.Активность,
		|	ЦеныНоменклатурыСрезПоследних.ТипЦен,
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры,
		|	ЦеныНоменклатурыСрезПоследних.Валюта,
		|	ЦеныНоменклатурыСрезПоследних.Цена,
		|	ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения,
		|	ЦеныНоменклатурыСрезПоследних.ПроцентСкидкиНаценки,
		|	ЦеныНоменклатурыСрезПоследних.СпособРасчетаЦены
		|ПОМЕСТИТЬ ЦеныНоменклатурыСрезПоследних
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			,
		|			ТипЦен В
		|				(ВЫБРАТЬ
		|					ТипыВидовЦен.ТипЦеныПрайса
		|				ИЗ
		|					ТипыВидовЦен КАК ТипыВидовЦен
		|				ГДЕ
		|					НЕ ТипыВидовЦен.ТипЦеныПрайса.Рассчитывается)) КАК ЦеныНоменклатурыСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Период,
		|	ЦеныНоменклатурыСрезПоследних.Регистратор,
		|	ЦеныНоменклатурыСрезПоследних.НомерСтроки,
		|	ЦеныНоменклатурыСрезПоследних.Активность,
		|	ТипыВидовЦен.ТипЦеныПрайса,
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры,
		|	ЦеныНоменклатурыСрезПоследних.Валюта,
		|	ЦеныНоменклатурыСрезПоследних.Цена * (1 + ТипыВидовЦен.ТипЦеныПрайса.ПроцентСкидкиНаценки / 100),
		|	ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения,
		|	ТипыВидовЦен.ТипЦеныПрайса.ПроцентСкидкиНаценки,
		|	ЦеныНоменклатурыСрезПоследних.СпособРасчетаЦены
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ) КАК ЦеныНоменклатурыСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТипыВидовЦен КАК ТипыВидовЦен
		|		ПО ЦеныНоменклатурыСрезПоследних.ТипЦен = ТипыВидовЦен.ТипЦеныПрайса.БазовыйТипЦен
		|ГДЕ
		|	ТипыВидовЦен.ТипЦеныПрайса.Рассчитывается
		|	И ТипыВидовЦен.ТипЦеныПрайса.СпособРасчетаЦены = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаЦены.ПоПроцентнойНаценкеНаБазовыйТип)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СправочникНоменклатура.Родитель КАК НоменклатураРодитель,
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	ОстаткиТоваров.Остаток КАК Количество,
		|	ВЫБОР
		|		КОГДА ЦеныНоменклатурыСрезПоследних.Валюта = &ВалютаРубли
		|			ТОГДА ЦеныНоменклатурыСрезПоследних.Цена
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
		|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
		|					ТОГДА ЦеныНоменклатурыСрезПоследних.Цена * (КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность)
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ КАК Цена,
		|	ЦеныНоменклатурыСрезПоследних.ТипЦен КАК ТипЦен,
		|	СправочникНоменклатура.КодПроизводителя КАК КодПроизводителя,
		|	СправочникНоменклатура.ЕдиницаХраненияОстатков,
		|	ВЫБОР
		|		КОГДА СправочникНоменклатура.Кратность = 0
		|			ТОГДА 1
		|		ИНАЧЕ СправочникНоменклатура.Кратность
		|	КОНЕЦ КАК Кратность,
		|	ВЫБОР
		|		КОГДА СправочникНоменклатура.Ссылка В ИЕРАРХИИ (&Уценка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоУценка
		|ПОМЕСТИТЬ ТабЦен
		|ИЗ
		|	ЦеныНоменклатурыСрезПоследних КАК ЦеныНоменклатурыСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
		|		ПО ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОстаткиТоваров КАК ОстаткиТоваров
		|		ПО (ОстаткиТоваров.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		|		ПО ЦеныНоменклатурыСрезПоследних.Номенклатура = СправочникНоменклатура.Ссылка
		|ГДЕ
		|	ОстаткиТоваров.Остаток > 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ТипЦен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РассылкаДокументов.Контрагент,
		|	КОЛИЧЕСТВО(РассылкаДокументов.Контрагент) КАК КоличествоОтправленных
		|ПОМЕСТИТЬ ТабРассылкаДокументовПоПочте
		|ИЗ
		|	РегистрСведений.РассылкаДокументов КАК РассылкаДокументов
		|ГДЕ
		|	РассылкаДокументов.Период МЕЖДУ &ПериодНачало И &ПериодОкончание
		|	И РассылкаДокументов.ТипРассылки = ЗНАЧЕНИЕ(Перечисление.ТипыРассылокЭлектроннойПочты.ПрайсЛист)
		|
		|СГРУППИРОВАТЬ ПО
		|	РассылкаДокументов.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РассылкаДокументов2.Контрагент,
		|	КОЛИЧЕСТВО(РассылкаДокументов2.Контрагент) КАК КоличествоОтправленных
		|ПОМЕСТИТЬ ТабРассылкаДокументовПоФТП
		|ИЗ
		|	РегистрСведений.РассылкаДокументов КАК РассылкаДокументов2
		|ГДЕ
		|	РассылкаДокументов2.Период МЕЖДУ &ПериодНачало И &ПериодОкончание
		|	И РассылкаДокументов2.ТипРассылки = ЗНАЧЕНИЕ(Перечисление.ТипыРассылокЭлектроннойПочты.ПрайсЛистНаФТП)
		|
		|СГРУППИРОВАТЬ ПО
		|	РассылкаДокументов2.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТипыВидовЦен.ТипЦеныПрайса
		|ИЗ
		|	ТипыВидовЦен КАК ТипыВидовЦен";

	КонецЕсли;
	
	Запрос.УстановитьПараметр("Уценка", Константы.ГруппаНоменклатурыУценка.Получить());
	Запрос.УстановитьПараметр("ТабЗагрузки", ТабКонтрагентов); 
	Запрос.УстановитьПараметр("Склад", Константы.ОсновнойСклад.Получить()); 
	Запрос.УстановитьПараметр("ВалютаРубли", Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("ПериодНачало",	НачалоДня(ТекущаяДата())); 
	Запрос.УстановитьПараметр("ПериодОкончание",КонецДня(ТекущаяДата())); 
	
	ТЗТиповЦен = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Стр ИЗ ТЗТиповЦен Цикл
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТипыЦенПоГруппамНоменклатурыДляПокупателейСрезПоследних.Контрагент,
		|	ТипыЦенПоГруппамНоменклатурыДляПокупателейСрезПоследних.НоменклатурнаяЦеноваяГруппа КАК ЦеноваяГруппа,
		|	ТипыЦенПоГруппамНоменклатурыДляПокупателейСрезПоследних.ТипЦен
		|ПОМЕСТИТЬ ЦеновыеГруппыИДинамичесиеТипыЦенНаДату
		|ИЗ
		|	РегистрСведений.ТипыЦенПоГруппамНоменклатурыДляПокупателей.СрезПоследних(&ПериодОкончание, ) КАК ТипыЦенПоГруппамНоменклатурыДляПокупателейСрезПоследних
		|ГДЕ
		|	ТипыЦенПоГруппамНоменклатурыДляПокупателейСрезПоследних.ТипЦен.Рассчитывается
		|	И ТипыЦенПоГруппамНоменклатурыДляПокупателейСрезПоследних.ТипЦен.СпособРасчетаЦены = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаЦены.ПоПроцентнойНаценкеНаБазовыйТип)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	ЦеновыеГруппыИДинамичесиеТипыЦенНаДату.Контрагент,
		|	ЦеновыеГруппыИДинамичесиеТипыЦенНаДату.ЦеноваяГруппа,
		|	ЦеновыеГруппыИДинамичесиеТипыЦенНаДату.ТипЦен КАК ДинамическийТипЦен,
		|	ЦеновыеГруппыИДинамичесиеТипыЦенНаДату.ТипЦен.БазовыйТипЦен КАК БазовыйТипЦен
		|ПОМЕСТИТЬ НоменклатураКонтрагентыТипыЦен
		|ИЗ
		|	ЦеновыеГруппыИДинамичесиеТипыЦенНаДату КАК ЦеновыеГруппыИДинамичесиеТипыЦенНаДату
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		|		ПО ЦеновыеГруппыИДинамичесиеТипыЦенНаДату.ЦеноваяГруппа = Номенклатура.ЦеноваяГруппа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НоменклатураКонтрагентыТипыЦен.Контрагент,
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.ТипЦен КАК БазовыйТипЦен,
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК ЦенаБазовая,
		|	НоменклатураКонтрагентыТипыЦен.ДинамическийТипЦен,
		|	ЦеныНоменклатурыСрезПоследних.Цена * (1 + НоменклатураКонтрагентыТипыЦен.ДинамическийТипЦен.ПроцентСкидкиНаценки / 100) КАК ЦенаРассчитанная
		|ПОМЕСТИТЬ ДинамическиеЦены
		|ИЗ
		|	НоменклатураКонтрагентыТипыЦен КАК НоменклатураКонтрагентыТипыЦен
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ПериодОкончание, ) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО НоменклатураКонтрагентыТипыЦен.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		|			И НоменклатураКонтрагентыТипыЦен.БазовыйТипЦен = ЦеныНоменклатурыСрезПоследних.ТипЦен
		|
		|	;
		|";
		
		Запрос.Текст = Запрос.Текст + 
		"ВЫБРАТЬ
		|	ТабЗагрузки.КонтрагентСсылка КАК КонтрагентСсылка,
		|	ТабЦен.НоменклатураРодитель КАК НоменклатураРодитель,
		|	ТабЦен.Номенклатура КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА ТабЗагрузки.МаксимальныйОстатокДляПрайса <> 0
		|			ТОГДА ВЫБОР
		|					КОГДА ТабЗагрузки.МаксимальныйОстатокДляПрайса < ТабЦен.Количество
		|						ТОГДА ТабЗагрузки.МаксимальныйОстатокДляПрайса
		|					ИНАЧЕ ТабЦен.Количество
		|				КОНЕЦ
		|		ИНАЧЕ ТабЦен.Количество
		|	КОНЕЦ КАК Количество,  ";
		
		Если мЭтоКазань Тогда 
			Запрос.Текст = Запрос.Текст+"
			|	ВЫБОР
			|		КОГДА ТабЗагрузки.МаксимальныйОстатокДляПрайса <> 0
			|			ТОГДА ВЫБОР
			|					КОГДА ТабЗагрузки.МаксимальныйОстатокДляПрайса < ТабЦен.КоличествоДляДоговоровСМК
			|						ТОГДА ТабЗагрузки.МаксимальныйОстатокДляПрайса
			|					ИНАЧЕ ТабЦен.КоличествоДляДоговоровСМК
			|				КОНЕЦ
			|		ИНАЧЕ ТабЦен.КоличествоДляДоговоровСМК
			|	КОНЕЦ КАК КоличествоДляДоговоровСМК,  ";					   
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + "
		|	ТабЦен.Количество КАК КоличествоРеальное,
		|	ТабЗагрузки.МаксимальныйОстатокДляПрайса,
		|	ТабЦен.Цена,
		|	ТабЦен.ТипЦен,
		|	ТабЦен.КодПроизводителя,
		|	ТабЦен.Кратность КАК Кратность, ";
		
		
		Если мЭтоКазань Тогда
			Запрос.Текст = Запрос.Текст + "
			|	ЛОЖЬ КАК НЕВыгружать, ";
		Иначе
			Запрос.Текст = Запрос.Текст + "
			|	ВЫБОР
			|	КОГДА Константы.ИспользоватьГруппуНоменклатурыУценка
			|			И Константы.ГруппаНоменклатурыУценка <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			|			И ТабРассылкаДокументовПоПочте.Контрагент.НеРассылатьПрайсыПоНоменклатуреВГруппеУценка
			|			И ТабЦен.ЭтоУценка
			|		ТОГДА ИСТИНА
			|	ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК НЕВыгружать, ";
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + "
		|	ТабЗагрузки.ВыкладыватьПрайсНаФТП,
		|	ТабЗагрузки.ФТПАдресДляПрайса,
		|	ТабЗагрузки.ФТПКаталогДляПрайса,
		|	ТабЗагрузки.ФТПЛогинДляПрайса,
		|	ТабЗагрузки.ФТППортДляПрайса,
		|	ТабЗагрузки.ФТППарольДляПрайса,
		|	ТабЗагрузки.ФорматФайлаПрайса,
		|	ТабЗагрузки.АрхивироватьПрайс,
		|	ТабЗагрузки.АдресЭлектроннойПочтыКонтрагентаДляРассылкиПрайса,
		|	ВЫБОР
		|		КОГДА ТабРассылкаДокументовПоПочте.Контрагент ЕСТЬ NULL 
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ТабЗагрузки.МаксимальноеКоличествоПрайсовВДень > ЕСТЬNULL(ТабРассылкаДокументовПоПочте.КоличествоОтправленных, 0)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ
		|	КОНЕЦ КАК РассылатьНаПочту,
		|	ВЫБОР
		|		КОГДА ТабЗагрузки.ВыкладыватьПрайсНаФТП
		|			ТОГДА ВЫБОР
		|					КОГДА ТабРассылкаДокументовПоФТП.Контрагент ЕСТЬ NULL 
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ВЫБОР
		|							КОГДА ТабЗагрузки.МаксимальноеКоличествоПрайсовВДень > ЕСТЬNULL(ТабРассылкаДокументовПоФТП.КоличествоОтправленных, 0)
		|								ТОГДА ИСТИНА
		|							ИНАЧЕ ЛОЖЬ
		|						КОНЕЦ
		|				КОНЕЦ
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК РассылатьНаФТП
		|ПОМЕСТИТЬ ТабПредварительная
		|ИЗ
		|	ТабЦен КАК ТабЦен
		|		ЛЕВОЕ СОЕДИНЕНИЕ Таб КАК ТабЗагрузки
		|			ЛЕВОЕ СОЕДИНЕНИЕ ТабРассылкаДокументовПоФТП КАК ТабРассылкаДокументовПоФТП
		|			ПО ТабЗагрузки.КонтрагентСсылка = ТабРассылкаДокументовПоФТП.Контрагент
		|			ЛЕВОЕ СОЕДИНЕНИЕ ТабРассылкаДокументовПоПочте КАК ТабРассылкаДокументовПоПочте
		|			ПО ТабЗагрузки.КонтрагентСсылка = ТабРассылкаДокументовПоПочте.Контрагент
		|		ПО (ТабЗагрузки.ТипЦеныПрайса = ТабЦен.ТипЦен),
		|		Константы КАК Константы
		|ГДЕ
		|	ТабЦен.ТипЦен = &ТипЦен
		|	И ТабЗагрузки.ТипЦеныПрайса = &ТипЦен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабПредварительная.КонтрагентСсылка КАК КонтрагентСсылка,
		|	ТабПредварительная.НоменклатураРодитель,
		|	ТабПредварительная.Номенклатура КАК Номенклатура,
		|	ТабПредварительная.Количество, ";
		
		Если мЭтоКазань Тогда 
			Запрос.Текст = Запрос.Текст + "
			|	ТабПредварительная.КоличествоДляДоговоровСМК, ";					   
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + "
		|	ТабПредварительная.КоличествоРеальное,
		|	ТабПредварительная.МаксимальныйОстатокДляПрайса,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(ДинамическиеЦены.ЦенаРассчитанная, ТабПредварительная.Цена) КАК ЧИСЛО(15,2)) КАК Цена,
		|	ЕСТЬNULL(ДинамическиеЦены.ДинамическийТипЦен, ТабПредварительная.ТипЦен) КАК ТипЦен,
		|	ТабПредварительная.КодПроизводителя,
		|	ТабПредварительная.Кратность,
		|	ТабПредварительная.ВыкладыватьПрайсНаФТП,
		|	ТабПредварительная.ФТПАдресДляПрайса,
		|	ТабПредварительная.ФТПКаталогДляПрайса,
		|	ТабПредварительная.ФТПЛогинДляПрайса,
		|	ТабПредварительная.ФТППортДляПрайса,
		|	ТабПредварительная.ФТППарольДляПрайса,
		|	ТабПредварительная.ФорматФайлаПрайса,
		|	ТабПредварительная.АрхивироватьПрайс,
		|	ТабПредварительная.АдресЭлектроннойПочтыКонтрагентаДляРассылкиПрайса,
		|	ТабПредварительная.РассылатьНаПочту,
		|	ТабПредварительная.РассылатьНаФТП
		|ИЗ
		|	ТабПредварительная КАК ТабПредварительная
		|	ЛЕВОЕ СОЕДИНЕНИЕ ДинамическиеЦены КАК ДинамическиеЦены
		|	ПО ТабПредварительная.КонтрагентСсылка = ДинамическиеЦены.Контрагент
		|		И ТабПредварительная.Номенклатура = ДинамическиеЦены.Номенклатура
		|ГДЕ
		|	(ТабПредварительная.РассылатьНаПочту
		|			ИЛИ ТабПредварительная.РассылатьНаФТП)
		| 	И НЕ ТабПредварительная.НЕВыгружать
		|
		|УПОРЯДОЧИТЬ ПО
		|	КонтрагентСсылка,
		|	Номенклатура
		|АВТОУПОРЯДОЧИВАНИЕ
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ДинамическиеЦены
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ НоменклатураКонтрагентыТипыЦен
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ЦеновыеГруппыИДинамичесиеТипыЦенНаДату
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТабПредварительная  ";
		
		Запрос.УстановитьПараметр("ТипЦен", Стр.ТипЦеныПрайса); 
		
		ПакетЗапросов = Запрос.ВыполнитьПакет();
		ТЗЦен = ПакетЗапросов[4].Выгрузить();
		
		ТекущийКонтрагент = "!!!";
		ПараметрыОтправки= Новый Массив;
		ДокументКОтправке = Новый ТабличныйДокумент;
		ОтправлятьЦеныМК = Ложь;
		
		Если ТЗЦен.Количество() = 0 Тогда 
			ТекстЛога = ТекстЛога + Символы.ПС + "Отправка писем не требуется!";
		Иначе	
			
			Для Каждого СтрКонтрагент ИЗ ТЗЦен Цикл
				
				Если ТекущийКонтрагент <> СтрКонтрагент.КонтрагентСсылка Тогда 
					
					Если мЭтоКазань Тогда 
						
						Если ЗначениеЗаполнено(СтрКонтрагент.КонтрагентСсылка.ОсновнойДоговорКонтрагента) И
							СтрКонтрагент.КонтрагентСсылка.ОсновнойДоговорКонтрагента.Организация = ОрганизацияМК Тогда 
							ОтправлятьЦеныМК = Истина;
						КонецЕсли;
						
					КонецЕсли;
					
					Если ТекущийКонтрагент <> "!!!" Тогда 
						ОтправитьКлиенту(ДатаОтчет, ПараметрыОтправки, ДокументКОтправке, УчетнаяЗаписьЭлектроннойПочты, ТекущийКонтрагент, ТекстЛога, Комментарий);
					КонецЕсли;	
					
					ТекущийКонтрагент = СтрКонтрагент.КонтрагентСсылка;
					ПараметрыОтправки.Очистить();
					ПараметрыОтправки.Добавить(СтрКонтрагент);
					
					Если СтрКонтрагент.ФорматФайлаПрайса = Перечисления.ТипыФайловРассылок.XLSx ИЛИ СтрКонтрагент.ФорматФайлаПрайса = Перечисления.ТипыФайловРассылок.XLS Тогда 
						
						ДокументКОтправке = Новый ТабличныйДокумент;
						Макет= ПолучитьМакет("ШаблонПрайса");
						ОбластьМакетаШапка = Макет.ПолучитьОбласть("ШапкаПрайса");
						ОбластьМакетаШапка.Параметры.ЗаголовокПрайса = "Все цены актуальны на " + ДатаОтчет;   
						ДокументКОтправке.Вывести(ОбластьМакетаШапка);
						
					КонецЕсли;
					
					Если СтрКонтрагент.ФорматФайлаПрайса = Перечисления.ТипыФайловРассылок.TXT ИЛИ СтрКонтрагент.ФорматФайлаПрайса = Перечисления.ТипыФайловРассылок.CSV Тогда 
						
						ДокументКОтправке = Новый ТекстовыйДокумент;
						ДокументКОтправке.ДобавитьСтроку("Прайс-лист. Цены актуальны на " + ДатаОтчет);
						ДокументКОтправке.ДобавитьСтроку(
						"Родитель" + Разделитель + 
						"Код производителя" + Разделитель + 
						"Номенклатура" + Разделитель + 
						"Мин.партия(Кратность)" + Разделитель + 
						"Количество" + Разделитель + 
						"Цена, руб" + Разделитель);
						
					КонецЕсли;
					
				КонецЕсли;
				
				Если СтрКонтрагент.РассылатьНаФТП  ИЛИ  СтрКонтрагент.РассылатьНаПочту Тогда 
					
					Если СтрКонтрагент.ФорматФайлаПрайса = Перечисления.ТипыФайловРассылок.XLSx ИЛИ СтрКонтрагент.ФорматФайлаПрайса = Перечисления.ТипыФайловРассылок.XLS Тогда 
						
						ОбластьМакетаСтрока = Макет.ПолучитьОбласть("СтрокаПрайса");
						ОбластьМакетаСтрока.Параметры.Заполнить(СтрКонтрагент);
						
						Если ОтправлятьЦеныМК Тогда
							ОбластьМакетаСтрока.Параметры.Количество =  СтрКонтрагент.КоличествоДляДоговоровСМК;
						КонецЕсли;
						
						Если ОбластьМакетаСтрока.Параметры.Количество > 0 Тогда 
							ДокументКОтправке.Вывести(ОбластьМакетаСтрока);
						КонецЕсли;
						
					КонецЕсли;
					
					Если СтрКонтрагент.ФорматФайлаПрайса = Перечисления.ТипыФайловРассылок.TXT ИЛИ СтрКонтрагент.ФорматФайлаПрайса = Перечисления.ТипыФайловРассылок.CSV Тогда 
						
						ТекКоличество = СтрКонтрагент.Количество;
						
						Если ОтправлятьЦеныМК Тогда
							ТекКоличество = СтрКонтрагент.КоличествоДляДоговоровСМК;
						КонецЕсли;
						
						Если ТекКоличество > 0 Тогда 
							
							ДокументКОтправке.ДобавитьСтроку(
							Строка(СтрКонтрагент.НоменклатураРодитель) + Разделитель + 
							СтрКонтрагент.КодПроизводителя + Разделитель + 
							СтрКонтрагент.Номенклатура + Разделитель + 
							СтрКонтрагент.Кратность + Разделитель + 
							СтрЗаменить(ТекКоличество, Символы.НПП, "") + Разделитель + 
							СтрЗаменить(СтрКонтрагент.Цена, Символы.НПП, "") + Разделитель);
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;	
			
		КонецЕсли;
		
		Если ТекущийКонтрагент <> "!!!" Тогда 
			ОтправитьКлиенту(ДатаОтчет, ПараметрыОтправки, ДокументКОтправке, УчетнаяЗаписьЭлектроннойПочты, ТекущийКонтрагент, ТекстЛога, Комментарий);
		КонецЕсли;		
		
	КонецЦикла;
	
	ТекстЛога = ТекстЛога+Символы.ПС+"Окончание работы обработки : "+ТекущаяДата();
	
КонецПроцедуры	

Процедура ОтправитьКлиенту(ДатаОтчет, ПараметрыОтправки, ДокументКОтправке, УчетнаяЗаписьЭлектроннойПочты, ТекущийКонтрагент, ТекстЛога, Комментарий = "")
	
	Если  НЕ ПараметрыОтправки[0].РассылатьНаФТП  И  НЕ ПараметрыОтправки[0].РассылатьНаПочту Тогда 
		
		ТекстСообщения = "Для клиента "+ТекущийКонтрагент+" на "+ДатаОтчет+" отправка цен не требуется.";
		
		#Если Клиент Тогда
			ТекстЛога = ТекстЛога+Символы.ПС+ТекстСообщения;
		#Иначе
			ЗаписьЖурналаРегистрации("ОбработкаРассылкаПрайсЛистов",УровеньЖурналаРегистрации.Информация,,,ТекстСообщения);
		#КонецЕсли 		
		
		Возврат;
		
	КонецЕсли;
	
	ФорматФайлаПрайсЛиста = ПараметрыОтправки[0].ФорматФайлаПрайса;
		
	Если ЗначениеЗаполнено(ТекущийКонтрагент.СтатичноеИмяДляПрайса) Тогда
		
		ИмяТекущегоФайлаБезРасширения = СокрЛП(ТекущийКонтрагент.СтатичноеИмяДляПрайса);
		ИмяТекущегоФайла = ИмяТекущегоФайлаБезРасширения + ФорматФайлаПрайсЛиста;
		
	Иначе
		
		Если мЭтоКазань Тогда
			
			ИмяТекущегоФайлаБезРасширения = "Price_Moskvorechie_" + Формат(Год(ДатаОтчет), "ЧГ=0") + Прав("0" + Месяц(ДатаОтчет), 2) + Прав("0" + День(ДатаОтчет), 2); 
			ИмяТекущегоФайла = ИмяТекущегоФайлаБезРасширения  +  ФорматФайлаПрайсЛиста;
			
		Иначе
			
			ИмяТекущегоФайлаБезРасширения = "Price_Moskvorechie_" + ?(НЕ мЭтоКазань, ТекущийКонтрагент.Код + "_", "") 
			                   + Формат(Год(ДатаОтчет), "ЧГ=0") + Прав("0" + Месяц(ДатаОтчет), 2) + Прав("0" + День(ДатаОтчет), 2);
			ИмяТекущегоФайла = ИмяТекущегоФайлаБезРасширения + ФорматФайлаПрайсЛиста;
			
		КонецЕсли;
		
	КонецЕсли;

	ИмяТекущегоФайла =СтрЗаменить(ИмяТекущегоФайла, ":", "_");
	ПолноеИмяФайла = КаталогВременныхФайлов() + ИмяТекущегоФайла;
	ПолноеИмяОтправляемогоФайла = ПолноеИмяФайла;
	
	Попытка
		
		Если ПараметрыОтправки[0].ФорматФайлаПрайса = Перечисления.ТипыФайловРассылок.XLSx ИЛИ ПараметрыОтправки[0].ФорматФайлаПрайса = Перечисления.ТипыФайловРассылок.XLS Тогда 
			ДокументКОтправке.Записать(ПолноеИмяФайла, ?(ПараметрыОтправки[0].ФорматФайлаПрайса = Перечисления.ТипыФайловРассылок.XLSx, ТипФайлаТабличногоДокумента.XLSX, ТипФайлаТабличногоДокумента.XLS));   
		ИначеЕсли ПараметрыОтправки[0].ФорматФайлаПрайса = Перечисления.ТипыФайловРассылок.TXT ИЛИ ПараметрыОтправки[0].ФорматФайлаПрайса = Перечисления.ТипыФайловРассылок.CSV Тогда 
			ДокументКОтправке.Записать(ПолноеИмяФайла);
		КонецЕсли;
		
	Исключение
		Возврат;
	КонецПопытки;

	ОтправкаВАрхиве = Ложь;
	
	// архивируем
	Если ПараметрыОтправки.Количество()> 0 Тогда 
		
		Если ПараметрыОтправки[0].АрхивироватьПрайс Тогда

			ПолноеИмяОтправляемогоФайлаОригинал = ПолноеИмяОтправляемогоФайла;
			ОтправкаВАрхиве = Истина;
			ФорматФайлаПрайсЛиста = ".zip";
			ПолноеИмяОтправляемогоФайла = ПолучитьИмяВременногоФайла("zip");
			
			АрхиваФайла = Новый ЗаписьZipФайла(ПолноеИмяОтправляемогоФайла);
			АрхиваФайла.Добавить(ПолноеИмяФайла, РежимСохраненияПутейZIP.СохранятьОтносительныеПути, РежимОбработкиПодкаталоговZIP.НеОбрабатывать);
			АрхиваФайла.Записать();

		КонецЕсли;	
		
	КонецЕсли;
	
	// пытаемся отправить
	Если ПараметрыОтправки[0].АдресЭлектроннойПочтыКонтрагентаДляРассылкиПрайса <>"" Тогда 
		
		Если  НЕ ПараметрыОтправки[0].РассылатьНаПочту Тогда 
			
			ТекстСообщения = "Для клиента "+ТекущийКонтрагент+" на "+ДатаОтчет+" файл с ценами уже был сформирован и отправлен на e-mail.";
			#Если Клиент Тогда
				ТекстЛога = ТекстЛога+Символы.ПС+ТекстСообщения;
			#Иначе
				ЗаписьЖурналаРегистрации("ОбработкаРассылкаПрайсЛистов",УровеньЖурналаРегистрации.Информация,,,ТекстСообщения);
			#КонецЕсли 
			
		Иначе
			
			Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗаписьЭлектроннойПочты);
			Почта = Новый ИнтернетПочта; 
			УдалосьПодключиться = Ложь;
			
			Попытка
				
				Почта.Подключиться(Профиль);
				УдалосьПодключиться = Истина;
				
			Исключение
				
				ТекстСообщения = "Не удалось подключиться к учетной записи электронной почты " + УчетнаяЗаписьЭлектроннойПочты;
				#Если Клиент Тогда
					ТекстЛога = ТекстЛога + Символы.ПС + " ERR: " + ТекстСообщения;
				#Иначе
					ЗаписьЖурналаРегистрации("ОбработкаРассылкаПрайсЛистов", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
				#КонецЕсли 
				
			КонецПопытки;
			
			Сообщение = Новый ИнтернетПочтовоеСообщение;
			Сообщение.Тема = "Прайс-лист(Москворечье) на " + ДатаОтчет;
			МассивАдресов = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(ПараметрыОтправки[0].АдресЭлектроннойПочтыКонтрагентаДляРассылкиПрайса, ";");
			
			Для каждого ТекАдрес Из МассивАдресов Цикл
				Сообщение.Получатели.Добавить(ТекАдрес); 
			КонецЦикла;
			
			Сообщение.Отправитель = УчетнаяЗаписьЭлектроннойПочты.АдресЭлектроннойПочты;
			
			УспешноОтправленПоПочте = Ложь;
			
			Попытка
				
				Файл = Новый Файл(ПолноеИмяОтправляемогоФайла);
				
				Если Файл.Существует() Тогда

					Сообщение.Вложения.Добавить(Новый ДвоичныеДанные(ПолноеИмяОтправляемогоФайла), ИмяТекущегоФайлаБезРасширения + ФорматФайлаПрайсЛиста);
					ЗаписьЖурналаРегистрации("ОбработкаРассылкаПрайсЛистов",УровеньЖурналаРегистрации.Информация,,, "Успешное прикрепление файла: " 
					+ ПолноеИмяОтправляемогоФайла + " формат: " + ПараметрыОтправки[0].ФорматФайлаПрайса);
					Почта.Послать(Сообщение);
					ТекстСообщения = "Отправлено письмо c ценами на дату " + ДатаОтчет + 
					" контрагенту :" + ТекущийКонтрагент + " на адрес " + ПараметрыОтправки[0].АдресЭлектроннойПочтыКонтрагентаДляРассылкиПрайса 
					+ "( формат отравки :" + ПараметрыОтправки[0].ФорматФайлаПрайса + ")";
					
					#Если Клиент Тогда
						ТекстЛога = ТекстЛога + Символы.ПС + " ОК : " + ТекстСообщения;
					#Иначе
						ЗаписьЖурналаРегистрации("ОбработкаРассылкаПрайсЛистов", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
					#КонецЕсли
					
					УспешноОтправленПоПочте = Истина;
					
				Иначе
					ЗаписьЖурналаРегистрации("ОбработкаРассылкаПрайсЛистов", УровеньЖурналаРегистрации.Ошибка,,,"Отсутствует файл: " + ПолноеИмяОтправляемогоФайла 
					+ " формат: " + ПараметрыОтправки[0].ФорматФайлаПрайса);	
				КонецЕсли; 				
				
			Исключение
				
				ТекстСообщения = "Не удалось отправить письмо с ценами на дату " + ДатаОтчет +
				" контрагенту :" + ТекущийКонтрагент + " на адрес " + ПараметрыОтправки[0].АдресЭлектроннойПочтыКонтрагентаДляРассылкиПрайса + " ошибка:" + ОписаниеОшибки();
				#Если Клиент Тогда
				#Иначе
					ЗаписьЖурналаРегистрации("ОбработкаРассылкаПрайсЛистов", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
				#КонецЕсли 
				
			КонецПопытки; 			
			
			// фиксируем успешную отправку
			Если УспешноОтправленПоПочте Тогда 
				
				НоваяЗаписьРассылкаДокументов 					= РегистрыСведений.РассылкаДокументов.СоздатьМенеджерЗаписи();
				НоваяЗаписьРассылкаДокументов.Период 			= ТекущаяДата();
				НоваяЗаписьРассылкаДокументов.Контрагент 		= ТекущийКонтрагент;
				НоваяЗаписьРассылкаДокументов.ТипРассылки 		= Перечисления.ТипыРассылокЭлектроннойПочты.ПрайсЛист;
				НоваяЗаписьРассылкаДокументов.ВремяОтправки 	= ТекущаяДата();
				НоваяЗаписьРассылкаДокументов.Комментарий 		= Комментарий;	
				НоваяЗаписьРассылкаДокументов.Записать();		
				
			КонецЕсли;	
			
		КонецЕсли;	
		
	Иначе
		#Если Клиент Тогда
		#Иначе
			ТекстСообщения = "У контрагента " + ТекущийКонтрагент + " не указан e-mail для отправки электронной почты. Письмо отправлено не будет";
			ЗаписьЖурналаРегистрации("ОбработкаРассылкаПрайсЛистов", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
		#КонецЕсли 		
	КонецЕсли;
	
	// ФТП
	Если ПараметрыОтправки[0].ВыкладыватьПрайсНаФТП Тогда 
		
		Если  НЕ ПараметрыОтправки[0].РассылатьНаФТП Тогда 
			
			ТекстСообщения = "Для клиента " + ТекущийКонтрагент + " на " + ДатаОтчет + " файл с ценами уже был сформирован и отправлен на FTP";
			#Если Клиент Тогда
				ТекстЛога = ТекстЛога + Символы.ПС + ТекстСообщения;
			#Иначе
				ЗаписьЖурналаРегистрации("ОбработкаРассылкаПрайсЛистов", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
			#КонецЕсли 
			
		Иначе
			
			УдалосьСоединитьсяСФТП = Ложь;
			
			Попытка
				
				СоединениеСFTP = Новый FTPСоединение(ПараметрыОтправки[0].ФТПАдресДляПрайса, Строка(ПараметрыОтправки[0].ФТППортДляПрайса), 
				ПараметрыОтправки[0].ФТПЛогинДляПрайса, ПараметрыОтправки[0].ФТППарольДляПрайса, , Истина);
				УдалосьСоединитьсяСФТП = Истина;
				
			Исключение
				
				ТекстСообщения = "Не удалось подключиться к FTP со следующими параметрами подключения: " + ПараметрыОтправки[0].ФТПАдресДляПрайса + ":" 
				+ ПараметрыОтправки[0].ФТППортДляПрайса + "; login:" + ПараметрыОтправки[0].ФТПЛогинДляПрайса + 
				"; password: " + ПараметрыОтправки[0].ФТППарольДляПрайса + ")";
				
				#Если Клиент Тогда
					ТекстЛога = ТекстЛога + Символы.ПС + " ERR: " + ТекстСообщения;
				#Иначе
					ЗаписьЖурналаРегистрации("ОбработкаРассылкаПрайсЛистов", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
				#КонецЕсли 			
				
			КонецПопытки;
			
			Если УдалосьСоединитьсяСФТП Тогда 
				
				УспешноОтправленПоФТП = Ложь;
				КаталогНаСервере = ПараметрыОтправки[0].ФТПКаталогДляПрайса;

				Попытка

					СоединениеСFTP.Записать(ПолноеИмяОтправляемогоФайла, ?(ЗначениеЗаполнено(КаталогНаСервере), КаталогНаСервере + "\", "") + ИмяТекущегоФайла);
					ТекстСообщения = "Файл " + ПолноеИмяОтправляемогоФайла + " успешно сохранен на FTP ( параметры подключения к FTP:" 
					+ ПараметрыОтправки[0].ФТПАдресДляПрайса + ":" + ПараметрыОтправки[0].ФТППортДляПрайса 
					+ ?(ЗначениеЗаполнено(КаталогНаСервере), "; каталог: " + КаталогНаСервере, "") 
					+ "; login:" + ПараметрыОтправки[0].ФТПЛогинДляПрайса  
					+ "; password: " + ПараметрыОтправки[0].ФТППарольДляПрайса + ")";
					
					#Если Клиент Тогда
						ТекстЛога = ТекстЛога + Символы.ПС + " ОК : " + ТекстСообщения;
					#Иначе
						ЗаписьЖурналаРегистрации("ОбработкаРассылкаПрайсЛистов", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
					#КонецЕсли 
					
					УспешноОтправленПоФТП = Истина;
					
				Исключение

					ТекстСообщения = "Не удалось сохранить файл на FTP! ( параметры подключения к FTP:" + ПараметрыОтправки[0].ФТПАдресДляПрайса 
					+ ":" + ПараметрыОтправки[0].ФТППортДляПрайса + ?(ЗначениеЗаполнено(КаталогНаСервере), "; каталог: " + КаталогНаСервере, "")  
					+ "; login:" + ПараметрыОтправки[0].ФТПЛогинДляПрайса 
					+ "; password: " + ПараметрыОтправки[0].ФТППарольДляПрайса + ")";
					
					#Если Клиент Тогда
						ТекстЛога = ТекстЛога + Символы.ПС + " ERR: " + ТекстСообщения;
					#Иначе
						ЗаписьЖурналаРегистрации("ОбработкаРассылкаПрайсЛистов", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
					#КонецЕсли 			
					
				КонецПопытки;
				
				Если УспешноОтправленПоФТП Тогда 
					
					НоваяЗаписьРассылкаДокументов 					= РегистрыСведений.РассылкаДокументов.СоздатьМенеджерЗаписи();
					НоваяЗаписьРассылкаДокументов.Период 			= ТекущаяДата();
					НоваяЗаписьРассылкаДокументов.Контрагент 		= ТекущийКонтрагент;
					НоваяЗаписьРассылкаДокументов.ТипРассылки 		= Перечисления.ТипыРассылокЭлектроннойПочты.ПрайсЛистНаФТП;
					НоваяЗаписьРассылкаДокументов.ВремяОтправки 	= ТекущаяДата();
					НоваяЗаписьРассылкаДокументов.Записать();
					
				КонецЕсли;				
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Попытка
		УдалитьФайлы(ПолноеИмяОтправляемогоФайла);
	Исключение
	КонецПопытки;

	Если ОтправкаВАрхиве Тогда
		
		Попытка
			УдалитьФайлы(ПолноеИмяОтправляемогоФайлаОригинал);
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры	

Процедура ЗаполнитьТаблицуНастроекКонтрагентов(ОчищатьТаблицу = Истина) Экспорт 
	
	Если ОчищатьТаблицу Тогда 
		НастройкиКонтрагентов.Очистить();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК КонтрагентСсылка,
	|	Контрагенты.Наименование КАК КонтрагентНаименование,
	|	Контрагенты.ТипЦеныПрайса,
	|	ЛОЖЬ КАК Изменен,
	|	Контрагенты.ВыкладыватьПрайсНаФТП КАК ВыкладыватьПрайсНаФТП,
	|	Контрагенты.ФТПАдресДляПрайса,
	|	Контрагенты.ФТПКаталогДляПрайса,
	|	Контрагенты.ФТППортДляПрайса,
	|	Контрагенты.ФТПЛогинДляПрайса,
	|	Контрагенты.ФТППарольДляПрайса,
	|	Контрагенты.ФорматФайлаПрайса,
	|	Контрагенты.АрхивироватьПрайс,
	|	Контрагенты.МаксимальныйОстатокДляПрайса,
	|	Контрагенты.РассылатьПрайс,
	|	ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК АдресЭлектроннойПочтыКонтрагентаДляРассылкиПрайса,
	|	ИСТИНА КАК СоздатьПрайсИОтослать,
	|	Контрагенты.МаксимальноеКоличествоПрайсовВДень
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО (КонтактнаяИнформация.Объект = Контрагенты.Ссылка)
	|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагентаДляРассылкиПрайса))
	|ГДЕ
	|	Контрагенты.РассылатьПрайс
	|
	|УПОРЯДОЧИТЬ ПО
	|	КонтрагентНаименование";
	
	ТаблицаНастроек = Запрос.Выполнить().Выгрузить();
	
	Для каждого Стр Из ТаблицаНастроек Цикл

		НоваяСтрока = ЭтотОбъект.НастройкиКонтрагентов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Стр);

	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуОтправленныхПрайсов(ОчищатьТаблицу = Истина) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(НаДату) Тогда 
		Возврат;
	КонецЕсли;	
	
	Если ОчищатьТаблицу Тогда 
		ОтправленныеПрайсы.Очистить();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РассылкаДокументов.Контрагент,
	|	РассылкаДокументов.ТипРассылки,
	|	РассылкаДокументов.ВремяОтправки КАК ВремяОтправки,
	|	РассылкаДокументов.Комментарий
	|ИЗ
	|	РегистрСведений.РассылкаДокументов КАК РассылкаДокументов
	|ГДЕ
	|	РассылкаДокументов.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И (РассылкаДокументов.ТипРассылки = ЗНАЧЕНИЕ(Перечисление.ТипыРассылокЭлектроннойПочты.ПрайсЛист)
	|			ИЛИ РассылкаДокументов.ТипРассылки = ЗНАЧЕНИЕ(Перечисление.ТипыРассылокЭлектроннойПочты.ПрайсЛистНаФТП))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВремяОтправки";
	
	Запрос.УстановитьПараметр("ДатаНачала",		НачалоДня(НаДату));
	Запрос.УстановитьПараметр("ДатаОкончания",	КонецДня(НаДату));
	
	ТаблицаНастроек = Запрос.Выполнить().Выгрузить();
	
	
	Для каждого Стр Из ТаблицаНастроек Цикл
		
		НоваяСтрока = ЭтотОбъект.ОтправленныеПрайсы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Стр);
		
	КонецЦикла;
	
КонецПроцедуры


Процедура ВыполнитьОбработкуРегламент() Экспорт;
	
	ЗаполнитьТаблицуНастроекКонтрагентов(Истина);	
	СформироватьИОтправитьПрайсыМодуль("", "Выполнено регламентым заданием 'Рассылка прайс-листов'");
	
КонецПроцедуры

мЭтоКазань = Константы.База.Получить() = Перечисления.НазваниеБазы.Казань;
